app/controllers/sessions_controller.rb

  def create

    @owner = Owner.where(email: params[:email]).first
    if @owner
      if @owner.authenticate(params[:password])
        session[:owner_id] = @owner.id
        redirect_to root_path, notice: "Welcome, #{@owner.name}"
      else
      flash.now[:alert] = "Invalid email or password"
      render :new
      end
    else
      @customer = Customer.where(email: params[:email]).first
---
SELECT "owners".* FROM "owners" WHERE "owners"."email" = 'bill@bill.com' ORDER BY "owners"."id" ASC LIMIT 1
SELECT "customers".* FROM "customers" WHERE "customers"."email" = 'customer@customer.com' ORDER BY "customers"."id" ASC LIMIT 1